
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Mysql 锁与事务 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Lock.html">
            
                <a href="Lock.html">
            
                    
                    Mysql 锁与事务
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Mysql 锁与事务</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="mysql">Mysql</h2>
<h3 id="1&#x9501;">1.&#x9501;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x9501;&#x6765;&#x652F;&#x6301;&#x5BF9;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#xFF0C;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x6027;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x9501;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<h4 id="11-&#x9501;&#x7684;&#x5206;&#x7C7B;">1.1 &#x9501;&#x7684;&#x5206;&#x7C7B;</h4>
<h5 id="111-&#x6309;&#x6A21;&#x5F0F;&#x5206;">1.1.1 &#x6309;&#x6A21;&#x5F0F;&#x5206;</h5>
<p>&#x9501;&#x7684;&#x6A21;&#x5F0F;&#x6709;&#xFF1A;&#x8BFB;&#x610F;&#x5411;&#x9501;&#xFF0C;&#x5199;&#x610F;&#x5411;&#x9501;&#xFF0C;&#x8BFB;&#x9501;&#xFF0C;&#x5199;&#x9501;&#x548C;&#x81EA;&#x589E;&#x9501;(auto_inc)&#xFF1A;</p>
<p>&#x8BFB;&#x9501;&#xFF0C;&#x53C8;&#x79F0;&#x5171;&#x4EAB;&#x9501;&#xFF08;Share locks&#xFF0C;&#x7B80;&#x79F0; S &#x9501;&#xFF09;&#xFF0C;&#x52A0;&#x4E86;&#x8BFB;&#x9501;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x540C;&#x65F6;&#x6709;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x5BF9;&#x8BB0;&#x5F55;&#x52A0;&#x8BFB;&#x9501;&#x3002;</p>
<p>&#x5199;&#x9501;&#xFF0C;&#x53C8;&#x79F0;&#x6392;&#x4ED6;&#x9501;&#xFF08;Exclusive locks&#xFF0C;&#x7B80;&#x79F0; X &#x9501;&#xFF09;&#xFF0C;&#x6216;&#x72EC;&#x5360;&#x9501;&#xFF0C;&#x5BF9;&#x8BB0;&#x5F55;&#x52A0;&#x4E86;&#x6392;&#x4ED6;&#x9501;&#x4E4B;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x62E5;&#x6709;&#x8BE5;&#x9501;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x90FD;&#x4E0D;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x52A0;&#x5199;&#x9501;&#x3002;</p>
<pre><code class="lang-mysql">CREATE DATABASE test;
USE test;
CREATE TABLE goods (
    id INT AUTO_INCREMENT, 
    num INT NOT NULL DEFAULT &apos;0&apos;, 
    PRIMARY KEY(id));
CREATE TABLE trade (
    id INT AUTO_INCREMENT, 
    goods_id INT, 
    user_id INT, 
    PRIMARY KEY(id));
SESSION A:
    LOCK TABLES goods WRITE;
    LOCK TABLES trade READ;
    UNLOCK TABLES;
SESSION B:
    SELECT * FROM goods;
    SELECT * FROM trade;
</code></pre>
<p>&#x8868;&#x9501;&#x548C;&#x884C;&#x9501;&#x867D;&#x7136;&#x9501;&#x5B9A;&#x8303;&#x56F4;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x76F8;&#x4E92;&#x51B2;&#x7A81;&#x3002;&#x8981;&#x52A0;&#x8868;&#x9501;&#x65F6;&#xFF0C;&#x52BF;&#x5FC5;&#x8981;&#x5148;&#x904D;&#x5386;&#x8BE5;&#x8868;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x5224;&#x65AD;&#x662F;&#x5426;&#x52A0;&#x6709;&#x6392;&#x4ED6;&#x9501;&#x3002;&#x8FD9;&#x79CD;&#x904D;&#x5386;&#x68C0;&#x67E5;&#x7684;&#x65B9;&#x5F0F;&#x663E;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x4F4E;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;MySQL &#x5F15;&#x5165;&#x4E86;&#x610F;&#x5411;&#x9501;&#xFF0C;&#x6765;&#x68C0;&#x6D4B;&#x8868;&#x9501;&#x548C;&#x884C;&#x9501;&#x7684;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x610F;&#x5411;&#x9501;&#x4E5F;&#x662F;&#x8868;&#x7EA7;&#x9501;&#xFF0C;&#x4E5F;&#x53EF;&#x5206;&#x4E3A;&#x8BFB;&#x610F;&#x5411;&#x9501;&#xFF08;IS &#x9501;&#xFF09;&#x548C;&#x5199;&#x610F;&#x5411;&#x9501;&#xFF08;IX &#x9501;&#xFF09;&#x3002;&#x5F53;&#x4E8B;&#x52A1;&#x8981;&#x5728;&#x8BB0;&#x5F55;&#x4E0A;&#x52A0;&#x4E0A;&#x8BFB;&#x9501;&#x6216;&#x5199;&#x9501;&#x65F6;&#xFF0C;&#x8981;&#x9996;&#x5148;&#x5728;&#x8868;&#x4E0A;&#x52A0;&#x4E0A;&#x610F;&#x5411;&#x9501;&#x3002;&#x8FD9;&#x6837;&#x5224;&#x65AD;&#x8868;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x8BB0;&#x5F55;&#x52A0;&#x9501;&#x5C31;&#x5F88;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x770B;&#x4E0B;&#x8868;&#x4E0A;&#x662F;&#x5426;&#x6709;&#x610F;&#x5411;&#x9501;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x610F;&#x5411;&#x9501;&#x4E4B;&#x95F4;&#x662F;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x548C; AUTO_INC &#x8868;&#x9501;&#x51B2;&#x7A81;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x963B;&#x585E;&#x8868;&#x7EA7;&#x8BFB;&#x9501;&#x6216;&#x8868;&#x7EA7;&#x5199;&#x9501;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x610F;&#x5411;&#x9501;&#x4E5F;&#x4E0D;&#x4F1A;&#x548C;&#x884C;&#x9501;&#x51B2;&#x7A81;&#xFF0C;&#x884C;&#x9501;&#x53EA;&#x4F1A;&#x548C;&#x884C;&#x9501;&#x51B2;&#x7A81;&#x3002;</p>
<pre><code class="lang-mysql">SESSION A:
    BEGIN;
    UPDATE goods SET num = 11 WHERE id=1;
SESSION B:
    BEGIN;
    UPDATE goods SET num = 11 WHERE id=1;
SESSION C:
    SELECT * FROM information_schema.INNODB_TRX\G
    SELECT * FROM information_schema.INNODB_LOCKS\G
    SELECT * FROM information_schema.INNODB_LOCK_WAITS\G
    SHOW status LIKE &apos;innodb_row_lock_%&apos;;
    SHOW OPEN TABLES where In_use &gt; 0;
</code></pre>
<p>AUTO_INC&#x9501;&#x53C8;&#x53EB;&#x81EA;&#x589E;&#x9501;&#xFF08;&#x4E00;&#x822C;&#x7B80;&#x5199;&#x6210;AI&#x9501;&#xFF09;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x9501;&#xFF0C;&#x5F53;&#x8868;&#x4E2D;&#x6709;&#x81EA;&#x589E;&#x5217;&#xFF08;AUTO_INCREMENT&#xFF09;&#x65F6;&#x51FA;&#x73B0;&#x3002;&#x5F53;&#x63D2;&#x5165;&#x8868;&#x4E2D;&#x6709;&#x81EA;&#x589E;&#x5217;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x81EA;&#x589E;&#x503C;&#xFF0C;&#x5B83;&#x4F1A;&#x5148;&#x4E3A;&#x8BE5;&#x8868;&#x52A0; AUTO_INC &#x8868;&#x9501;&#xFF0C;&#x963B;&#x585E;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x4FDD;&#x8BC1;&#x751F;&#x6210;&#x7684;&#x81EA;&#x589E;&#x503C;&#x80AF;&#x5B9A;&#x662F;&#x552F;&#x4E00;&#x7684;&#x3002;AUTO_INC &#x9501;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<p>AUTO_INC&#x9501;&#x4E92;&#x4E0D;&#x517C;&#x5BB9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x540C;&#x4E00;&#x5F20;&#x8868;&#x540C;&#x65F6;&#x53EA;&#x5141;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x589E;&#x9501;&#xFF1B;
&#x81EA;&#x589E;&#x503C;&#x4E00;&#x65E6;&#x5206;&#x914D;&#x4E86;&#x5C31;&#x4F1A; +1&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#xFF0C;&#x81EA;&#x589E;&#x503C;&#x4E5F;&#x4E0D;&#x4F1A;&#x51CF;&#x56DE;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#x81EA;&#x589E;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E2D;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x3002;
&#x663E;&#x7136;&#xFF0C;AUTO_INC &#x8868;&#x9501;&#x4F1A;&#x5BFC;&#x81F4;&#x5E76;&#x53D1;&#x63D2;&#x5165;&#x7684;&#x6548;&#x7387;&#x964D;&#x4F4E;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x63D2;&#x5165;&#x7684;&#x5E76;&#x53D1;&#x6027;&#xFF0C;MySQL &#x4ECE; 5.1.22 &#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x9009;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#xFF08;mutex&#xFF09;&#x673A;&#x5236;&#x6765;&#x4EE3;&#x66FF; AUTO_INC &#x9501;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570; innodb_autoinc_lock_mode &#x6765;&#x7075;&#x6D3B;&#x63A7;&#x5236;&#x5206;&#x914D;&#x81EA;&#x589E;&#x503C;&#x65F6;&#x7684;&#x5E76;&#x53D1;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x517C;&#x5BB9;&#x8868;</p>
<table>
<thead>
<tr>
<th>-</th>
<th>IS</th>
<th>IX</th>
<th>S</th>
<th>X</th>
<th>AI</th>
</tr>
</thead>
<tbody>
<tr>
<td>IS</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>-</td>
<td>&#x221A;</td>
</tr>
<tr>
<td>IX</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>-</td>
<td>-</td>
<td>&#x221A;</td>
</tr>
<tr>
<td>S</td>
<td>&#x221A;</td>
<td>-</td>
<td>&#x221A;</td>
<td>-</td>
<td>-</td>
</tr>
<tr>
<td>X</td>
<td></td>
<td></td>
<td></td>
<td></td>
<td></td>
</tr>
<tr>
<td>AI</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td></td>
<td></td>
</tr>
</tbody>
</table>
<p>&#x603B;&#x7ED3;&#x8D77;&#x6765;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#xFF1A;</p>
<p>&#x610F;&#x5411;&#x9501;&#x4E4B;&#x95F4;&#x4E92;&#x4E0D;&#x51B2;&#x7A81;&#xFF1B;
S &#x9501;&#x53EA;&#x548C; S/IS &#x9501;&#x517C;&#x5BB9;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x9501;&#x90FD;&#x51B2;&#x7A81;&#xFF1B;
X &#x9501;&#x548C;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x9501;&#x90FD;&#x51B2;&#x7A81;&#xFF1B;
AI &#x9501;&#x53EA;&#x548C;&#x610F;&#x5411;&#x9501;&#x517C;&#x5BB9;</p>
<h5 id="112-&#x6309;&#x7C92;&#x5EA6;&#x5206;">1.1.2 &#x6309;&#x7C92;&#x5EA6;&#x5206;</h5>
<p>1). &#x8868;&#x9501;</p>
<p>&#x8868;&#x9501;&#x662F;&#x6307;&#x5BF9;&#x4E00;&#x6574;&#x5F20;&#x8868;&#x52A0;&#x9501;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x6267;&#x884C;DDL&#x65F6;&#x4F7F;&#x7528;&#xFF0C;&#x7531;Mysql Server&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8868;&#x9501;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x9501;&#x6280;&#x672F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x4F1A;&#x8BDD;&#x5F00;&#x59CB;&#x7684;&#x5730;&#x65B9;&#x4F7F;&#x7528; lock &#x547D;&#x4EE4;&#x5C06;&#x540E;&#x7EED;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x8868;&#x90FD;&#x52A0;&#x4E0A;&#x9501;&#xFF0C;&#x5728;&#x8868;&#x91CA;&#x653E;&#x524D;&#xFF0C;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x52A0;&#x9501;&#x7684;&#x8868;&#xFF0C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x8868;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x901A;&#x8FC7; unlock tables &#x91CA;&#x653E;&#x6240;&#x6709;&#x8868;&#x9501;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4F7F;&#x7528; unlock tables &#x663E;&#x793A;&#x91CA;&#x653E;&#x9501;&#x4E4B;&#x5916;&#xFF0C;&#x4F1A;&#x8BDD;&#x6301;&#x6709;&#x5176;&#x4ED6;&#x8868;&#x9501;&#x65F6;&#x6267;&#x884C;lock table &#x8BED;&#x53E5;&#x4F1A;&#x91CA;&#x653E;&#x4F1A;&#x8BDD;&#x4E4B;&#x524D;&#x6301;&#x6709;&#x7684;&#x9501;&#xFF1B;&#x4F1A;&#x8BDD;&#x6301;&#x6709;&#x5176;&#x4ED6;&#x8868;&#x9501;&#x65F6;&#x6267;&#x884C; start transaction &#x6216;&#x8005; begin &#x5F00;&#x542F;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x91CA;&#x653E;&#x4E4B;&#x524D;&#x6301;&#x6709;&#x7684;&#x9501;&#x3002;</p>
<pre><code class="lang-mysql">SESSION A:
    LOCK TABLES goods WRITE;
    SELECT * FROM trade;
    LOCK TABLES trade READ;
    UNLOCK TABLES;
SESSION B:
    SELECT * FROM goods;
    SELECT * FROM goods;
    SELECT * FROM trade;
</code></pre>
<p>2). &#x884C;&#x9501;</p>
<p>&#x4E0D;&#x540C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7684;&#x884C;&#x9501;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5F15;&#x64CE;InnoDB&#x652F;&#x6301;&#x884C;&#x9501;&#xFF0C;MyISAM&#x4E0D;&#x652F;&#x6301;&#x884C;&#x9501;&#xFF0C;&#x540E;&#x7EED;&#x90FD;&#x662F;&#x9488;&#x5BF9;InnoDB&#x5F15;&#x64CE;&#x3002;</p>
<p>&#x5728;&#x4E86;&#x89E3; InnoDB &#x7684;&#x52A0;&#x9501;&#x539F;&#x7406;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E86;&#x89E3;&#x3002;InnoDB &#x662F;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; B+&#x6811;&#x7684;&#x53F6;&#x8282;&#x70B9;&#x65E2;&#x5B58;&#x50A8;&#x4E86;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E5F;&#x5B58;&#x50A8;&#x4E86;&#x6570;&#x636E;&#x884C;&#x3002;&#x800C; InnoDB &#x7684;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x7684;&#x53F6;&#x8282;&#x70B9;&#x5B58;&#x50A8;&#x7684;&#x5219;&#x662F;&#x4E3B;&#x952E;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x62FF;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x952E;&#x53BB;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x4E2D;&#x518D;&#x6B21;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x3002;
&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x52A0;&#x4E00;&#x628A;&#x9501;&#xFF0C;&#x4F7F;&#x7528;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x5728;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x548C;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E0A;&#x5404;&#x52A0;&#x4E00;&#x628A;&#x9501;&#x3002;</p>
<p>&#x884C;&#x9501;&#x6839;&#x636E;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x53C8;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;Record Lock(&#x8BB0;&#x5F55;&#x9501;)&#x3001;Gap Lock(&#x95F4;&#x9699;&#x9501;)&#x3001;Next-key Lock&#x548C;II GAP(&#x63D2;&#x5165;&#x610F;&#x5411;&#x9501;)&#x3002;</p>
<p>&#x8BB0;&#x5F55;&#x9501;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x884C;&#x9501;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x52A0;&#x9501;&#x3002;</p>
<p>&#x5F53; SQL &#x8BED;&#x53E5;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019; MySQL &#x4F1A;&#x7ED9;&#x6574;&#x5F20;&#x8868;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x884C;&#x52A0;&#x8BB0;&#x5F55;&#x9501;&#xFF0C;&#x518D;&#x7531; MySQL Server&#x5C42;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x3002;&#x5728;MySQL Server&#x5C42;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E0D;&#x6EE1;&#x8DB3; WHERE &#x6761;&#x4EF6;&#xFF0C;&#x4F1A;&#x91CA;&#x653E;&#x5BF9;&#x5E94;&#x8BB0;&#x5F55;&#x7684;&#x9501;&#x3002;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x6700;&#x540E;&#x53EA;&#x4F1A;&#x6301;&#x6709;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x8BB0;&#x5F55;&#x4E0A;&#x7684;&#x9501;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x52A0;&#x9501;&#x64CD;&#x4F5C;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x7701;&#x7565;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x8981;&#x6839;&#x636E;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x4E0D;&#x4EC5;&#x4F1A;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x7684;&#x9501;&#x8D44;&#x6E90;&#xFF0C;&#x589E;&#x52A0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x8FD8;&#x4F1A;&#x6781;&#x5927;&#x7684;&#x964D;&#x4F4E;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;</p>
<pre><code class="lang-mysql">SELECT * FROM goods WHERE id &gt; 0 LOCK IN SHARE MODE;
SELECT * FROM goods WHERE id &gt; 0 FOR UPDATE;
</code></pre>
<p>&#x95F4;&#x9699;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x52A0;&#x5728;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x95F4;&#x7684;&#x9501;&#xFF0C;&#x6216;&#x8005;&#x52A0;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x524D;&#xFF0C;&#x6216;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x540E;&#x7684;&#x95F4;&#x9699;&#x3002;&#x8FD9;&#x4E2A;&#x95F4;&#x9699;&#x53EF;&#x4EE5;&#x8DE8;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x8BB0;&#x5F55;&#xFF0C;&#x591A;&#x4E2A;&#x7D22;&#x5F15;&#x8BB0;&#x5F55;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x7A7A;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x95F4;&#x9699;&#x9501;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5728;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#x63D2;&#x5165;&#x6216;&#x4FEE;&#x6539;&#x8BB0;&#x5F55;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E24;&#x6B21;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#x7684;&#x8BB0;&#x5F55;&#x4E0D;&#x4F1A;&#x53D8;&#xFF0C;&#x4ECE;&#x800C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5E7B;&#x8BFB;&#x73B0;&#x8C61;&#x3002;
&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;id=6&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x66F4;&#x65B0;&#x8FD9;&#x6761;&#x6570;&#x636E;&#x8FD8;&#x4F1A;&#x52A0;&#x9501;&#x5417;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x53EF;&#x80FD;&#x6709;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728; RC &#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0D;&#x4F1A;&#x52A0;&#x4EFB;&#x4F55;&#x9501;&#xFF0C;&#x5728; RR &#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4F1A;&#x5728; id = 6 &#x524D;&#x540E;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x95F4;&#x52A0;&#x4E0A;&#x95F4;&#x9699;&#x9501;&#x3002;</p>
<pre><code class="lang-mysql">SESSION A:
    BEGIN;
    UPDATE goods SET num = 10 WHERE id=3;
SESSION B:
    INSERT goods (id, num) VALUES (2, 11);
</code></pre>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x95F4;&#x9699;&#x9501;&#x548C;&#x95F4;&#x9699;&#x9501;&#x4E4B;&#x95F4;&#x662F;&#x4E92;&#x4E0D;&#x51B2;&#x7A81;&#x7684;&#xFF0C;&#x95F4;&#x9699;&#x9501;&#x552F;&#x4E00;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x63D2;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x95F4;&#x9699; S &#x9501;&#x548C;&#x52A0;&#x95F4;&#x9699; X &#x9501;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#x3002;</p>
<p>Next-key&#x9501;&#x662F;&#x8BB0;&#x5F55;&#x9501;&#x548C;&#x95F4;&#x9699;&#x9501;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5B83;&#x6307;&#x7684;&#x662F;&#x52A0;&#x5728;&#x67D0;&#x6761;&#x8BB0;&#x5F55;&#x4EE5;&#x53CA;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x524D;&#x9762;&#x95F4;&#x9699;&#x4E0A;&#x7684;&#x9501;&#x3002;&#x548C;&#x95F4;&#x9699;&#x9501;&#x4E00;&#x6837;&#xFF0C;&#x5728;RC&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x6CA1;&#x6709;Next-key&#x9501;&#xFF0C;&#x53EA;&#x6709;RR&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x624D;&#x6709;&#x3002;
InnoDB&#x4E2D;&#x884C;&#x9501;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7B97;&#x6CD5;Next-Key Lock&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x67E5;&#x8BE2;&#x7684;&#x7D22;&#x5F15;&#x662F;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x6216;&#x4E3B;&#x952E;&#x65F6;&#xFF0C;InnoDB&#x4F1A;&#x5BF9;Next-Key Lock&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x5C06;&#x5176;&#x964D;&#x7EA7;&#x4E3A;Record Lock&#xFF0C;&#x5373;&#x4EC5;&#x9501;&#x4F4F;&#x7D22;&#x5F15;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8303;&#x56F4;&#x3002;&#x5F53;&#x67E5;&#x8BE2;&#x7684;&#x7D22;&#x5F15;&#x4E3A;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;InnoDB&#x5219;&#x4F1A;&#x4F7F;&#x7528;Next-Key Lock&#x8FDB;&#x884C;&#x52A0;&#x9501;&#x3002;InnoDB&#x5BF9;&#x4E8E;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4E0D;&#x4EC5;&#x4F1A;&#x9501;&#x4F4F;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x503C;&#x6240;&#x5728;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x8FD8;&#x4F1A;&#x5C06;&#x5176;&#x4E0B;&#x4E00;&#x952E;&#x503C;&#x52A0;&#x4E0A;Gap LOCK&#x3002;</p>
<pre><code class="lang-mysql">SESSION A:
    BEGIN;
    SELECT * FROM goods WHERE price = 6 FOR UPDATE;
SESSION B:
    select * from goods where id=9 for update;
    insert goods (num,price) values (10,3);
    insert goods (num,price) values (10,8);
</code></pre>
<table>
<thead>
<tr>
<th>-</th>
<th>RECORD</th>
<th>GAP</th>
<th>NEXT-KEY</th>
</tr>
</thead>
<tbody>
<tr>
<td>RECORD</td>
<td>-</td>
<td>&#x221A;</td>
<td>-</td>
</tr>
<tr>
<td>GAP</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
</tr>
<tr>
<td>NEXT-KEY</td>
<td>-</td>
<td>&#x221A;</td>
<td>-</td>
</tr>
</tbody>
</table>
<h3 id="2&#x4E8B;&#x52A1;">2.&#x4E8B;&#x52A1;</h3>
<h4 id="21-&#x4E8B;&#x52A1;&#x662F;&#x4EC0;&#x4E48;">2.1 &#x4E8B;&#x52A1;&#x662F;&#x4EC0;&#x4E48;</h4>
<p>&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8B;&#x52A1;&#xFF08;Transaction&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x3001;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x3002;&#x4E8B;&#x52A1;&#x628A;&#x6240;&#x6709;&#x7684;&#x547D;&#x4EE4;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x4E00;&#x8D77;&#x5411;&#x7CFB;&#x7EDF;&#x63D0;&#x4EA4;&#x6216;&#x64A4;&#x9500;&#x64CD;&#x4F5C;&#x8BF7;&#x6C42;&#xFF0C;&#x5373;&#x8FD9;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x8981;&#x4E48;&#x90FD;&#x6267;&#x884C;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x5DE5;&#x4F5C;&#x903B;&#x8F91;&#x5355;&#x5143;&#x3002;</p>
<p>&#x5728;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E0A;&#x6267;&#x884C;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;&#x662F;&#x4F5C;&#x4E3A;&#x6700;&#x5C0F;&#x7684;&#x63A7;&#x5236;&#x5355;&#x5143;&#x6765;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x591A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#x7684;&#x8BA2;&#x7968;&#x7CFB;&#x7EDF;&#x3001;&#x94F6;&#x884C;&#x3001;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x4EE5;&#x53CA;&#x8BC1;&#x5238;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x7B49;&#x3002;</p>
<h4 id="22-&#x4E8B;&#x52A1;&#x7684;&#x7279;&#x6027;">2.2 &#x4E8B;&#x52A1;&#x7684;&#x7279;&#x6027;</h4>
<p>&#x4E8B;&#x52A1;&#x5177;&#x6709; 4 &#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x5373;&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;&#x3001;&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;&#x3001;&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;&#x548C;&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;&#xFF0C;&#x8FD9; 4 &#x4E2A;&#x7279;&#x6027;&#x901A;&#x5E38;&#x7B80;&#x79F0;&#x4E3A; ACID&#x3002;</p>
<h6 id="&#x539F;&#x5B50;&#x6027;">&#x539F;&#x5B50;&#x6027;</h6>
<p>&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4E8B;&#x52A1;&#x7684;&#x5404;&#x5143;&#x7D20;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#xFF08;&#x539F;&#x5B50;&#x7684;&#xFF09;&#x3002;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x63D0;&#x4EA4;&#x6216;&#x56DE;&#x6EDA;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x5C06;&#x5931;&#x8D25;&#x3002;</p>
<h6 id="&#x4E00;&#x81F4;&#x6027;">&#x4E00;&#x81F4;&#x6027;</h6>
<p>&#x5F53;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002;&#x5728;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x4E2D;. &#x6570;&#x636E;&#x53EF;&#x80FD;&#x5904;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x6709;&#x90E8;&#x5206;&#x88AB;&#x4FEE;&#x6539;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x518D;&#x6B21;&#x56DE;&#x5230;&#x5DF2;&#x77E5;&#x7684;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002;&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#x4E0D;&#x80FD;&#x635F;&#x574F;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x4F7F;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5904;&#x4E8E;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<h6 id="&#x9694;&#x79BB;&#x6027;">&#x9694;&#x79BB;&#x6027;</h6>
<p>&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x7684;&#x6240;&#x6709;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x662F;&#x5F7C;&#x6B64;&#x9694;&#x79BB;&#x7684;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5B83;&#x4E0D;&#x5E94;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x4F9D;&#x8D56;&#x4E8E;&#x6216;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x3002;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;</p>
<h6 id="&#x6301;&#x4E45;&#x6027;">&#x6301;&#x4E45;&#x6027;</h6>
<p>&#x4E8B;&#x52A1;&#x7684;&#x6301;&#x4E45;&#x6027;&#x6307;&#x4E0D;&#x7BA1;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x53D1;&#x751F;&#x4E86;&#x6545;&#x969C;&#xFF0C;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x662F;&#x6C38;&#x4E45;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6240;&#x4F5C;&#x7684;&#x6539;&#x53D8;&#x662F;&#x6C38;&#x4E45;&#x6027;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x65E6;&#x4E8B;&#x52A1;&#x88AB;&#x63D0;&#x4EA4;&#xFF0C;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x6240;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x52A8;&#x90FD;&#x4F1A;&#x88AB;&#x6C38;&#x4E45;&#x5730;&#x4FDD;&#x7559;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p>Mysql&#x4E2D;&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x6027;&#x7531;&#x591A;&#x7248;&#x672C;&#x63A7;&#x5236;&#x673A;&#x5236;&#x548C;&#x9501;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x539F;&#x5B50;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x901A;&#x8FC7;InnoDB&#x7684;redo log&#x3001;undo log&#x548C;Force Log at Commit&#x673A;&#x5236;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h4 id="23-mysql&#x4E2D;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x64CD;&#x4F5C;">2.3 Mysql&#x4E2D;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x64CD;&#x4F5C;</h4>
<table>
<thead>
<tr>
<th>&#x8BED;&#x53E5;</th>
<th>&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody>
<tr>
<td>BEGIN; START TRANSACTION;SET AUTOCOMMIT=0</td>
<td>&#x5F00;&#x542F;&#x4E8B;&#x52A1;</td>
</tr>
<tr>
<td>COMMIT; COMMIT WORK</td>
<td>&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;</td>
</tr>
<tr>
<td>ROLLBACK; ROLLBACK WORK</td>
<td>&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;</td>
</tr>
<tr>
<td>SAVEPOINT identifier</td>
<td>&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x70B9;</td>
</tr>
<tr>
<td>RELEASE SAVEPOINT identifier</td>
<td>&#x5220;&#x9664;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4FDD;&#x5B58;&#x70B9;</td>
</tr>
<tr>
<td>ROLLBACK TO identifier</td>
<td>&#x56DE;&#x6EDA;&#x5230;&#x6307;&#x5B9A;&#x4FDD;&#x5B58;&#x70B9;</td>
</tr>
</tbody>
</table>
<pre><code class="lang-mysql">SET [GLOBAL || SESSION] TRANSACTION ISOLATION LEVEL [];
</code></pre>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;</p>
<pre><code class="lang-mysql">COMPLETION_TYPE
</code></pre>
<p>&#x53C2;&#x6570;&#x6765;&#x63A7;&#x5236;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x540E;&#x7684;&#x52A8;&#x4F5C;&#x3002;</p>
<table>
<thead>
<tr>
<th>COMPLETION_TYPE</th>
<th>&#x52A8;&#x4F5C;</th>
</tr>
</thead>
<tbody>
<tr>
<td>0</td>
<td>&#x65E0;</td>
</tr>
<tr>
<td>1</td>
<td>&#x9A6C;&#x4E0A;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x76F8;&#x540C;&#x7684;&#x4E8B;&#x52A1;</td>
</tr>
<tr>
<td>2</td>
<td>COMMIT AND RELEASE,&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x540E;&#x65AD;&#x5F00;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDE;&#x63A5;</td>
</tr>
</tbody>
</table>
<pre><code class="lang-mysql">CREATE DATABASE student;
CREATE TABLE `stu_info` (
`stu_id` int NOT NULL AUTO_INCREMENT,
`name` varchar(25) DEFAULT NULL,
`age` int DEFAULT NULL,
 PRIMARY KEY (`stu_id`)
) ENGINE=InnoDB AUTO_INCREMENT=0;
INSERT stu_info (name,age) VALUES (&apos;ldy&apos;,25);


SELECT * FROM stu_info;
SET @@COMPLETION_TYPE = 0;
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
COMMIT;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
ROLLBACK;
SELECT * FROM stu_info;

SELECT * FROM stu_info;
SET @@COMPLETION_TYPE = 1;
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
COMMIT;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
ROLLBACK;
SELECT * FROM stu_info;

SELECT * FROM stu_info;
SET @@COMPLETION_TYPE = 2;
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
COMMIT;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
ROLLBACK;
SELECT * FROM stu_info;
</code></pre>
<h4 id="24-&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;">2.4 &#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;</h4>
<p>1&#x3001;&#x810F;&#x8BFB;&#xFF1A;&#x4E8B;&#x52A1;A&#x8BFB;&#x53D6;&#x4E86;&#x4E8B;&#x52A1;B&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;B&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;A&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x810F;&#x6570;&#x636E;</p>
<pre><code class="lang-mysql">SELECT @@TRANSACTION_ISOLATION;
SET SESSION TRANSACTION ISOLATION LEVEL READ UNCOMMITTED;

session A:
BEGIN;
SELECT * FROM stu_info;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
commit;

session B:
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
</code></pre>
<p>2&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF1A;&#x4E8B;&#x52A1;A&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x6570;&#x636E;&#xFF0C;&#x4E8B;&#x52A1;B&#x5728;&#x4E8B;&#x52A1;A&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x4F5C;&#x4E86;&#x66F4;&#x65B0;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;&#x5BFC;&#x81F4;&#x4E8B;&#x52A1;A&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x7ED3;&#x679C;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
<pre><code class="lang-mysql">SELECT @@TRANSACTION_ISOLATION;
SET SESSION TRANSACTION ISOLATION LEVEL READ COMMITTED;

session A:
BEGIN;
SELECT * FROM stu_info;
wait B;
SELECT * FROM stu_info;
commit;

session B:
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
COMMIT;
</code></pre>
<p>3&#x3001;&#x5E7B;&#x8BFB;&#xFF1A;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;A&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6240;&#x6709;&#x5B66;&#x751F;&#x7684;&#x6210;&#x7EE9;&#x4ECE;&#x5177;&#x4F53;&#x5206;&#x6570;&#x6539;&#x4E3A;ABCDE&#x7B49;&#x7EA7;&#xFF0C;&#x4F46;&#x662F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;B&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x6761;&#x5177;&#x4F53;&#x5206;&#x6570;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5F53;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;A&#x6539;&#x7ED3;&#x675F;&#x540E;&#x53D1;&#x73B0;&#x8FD8;&#x6709;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x6CA1;&#x6709;&#x6539;&#x8FC7;&#x6765;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x53D1;&#x751F;&#x4E86;&#x5E7B;&#x89C9;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x5C31;&#x53EB;&#x5E7B;&#x8BFB;&#x3002;</p>
<pre><code class="lang-mysql">SELECT @@TRANSACTION_ISOLATION;
SET SESSION TRANSACTION ISOLATION LEVEL REPEATABLE READ;

session A:
BEGIN;
SELECT * FROM stu_info;
wait B;
SELECT * FROM stu_info;
commit;

session B:
BEGIN;
UPDATE stu_info SET age = age+1 WHERE stu_id = 1;
INSERT INTO stu_info (name, age) VALUES (&apos;ldy&apos;, 22);
COMMIT;
</code></pre>
<h4 id="25-mysql&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;">2.5 Mysql&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;</h4>
<table>
<thead>
<tr>
<th>&#x9694;&#x79BB;&#x7EA7;&#x522B;</th>
<th>&#x810F;&#x8BFB;</th>
<th>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</th>
<th>&#x5E7B;&#x8BFB;</th>
</tr>
</thead>
<tbody>
<tr>
<td>READ UNCOMMITTED</td>
<td>&#xD7;</td>
<td>&#xD7;</td>
<td>&#xD7;</td>
</tr>
<tr>
<td>READ COMMITTED</td>
<td>&#x221A;</td>
<td>&#xD7;</td>
<td>&#xD7;</td>
</tr>
<tr>
<td>REPEATABLE READ</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>&#xD7;</td>
</tr>
<tr>
<td>SERIALIZE</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
<td>&#x221A;</td>
</tr>
</tbody>
</table>
<h4 id="26-innodb&#x7684;mvcc&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x673A;&#x5236;">2.6 InnoDB&#x7684;MVCC(&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;)&#x673A;&#x5236;</h4>
<p>MVCC&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;(Multi-Version Concurrency Control)&#x662F;MySQL&#x4E2D;&#x57FA;&#x4E8E;&#x4E50;&#x89C2;&#x9501;&#x7406;&#x8BBA;&#x5B9E;&#x73B0;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</p>
<p>InnoDB&#x884C;&#x8BB0;&#x5F55;&#x6709;&#x4E09;&#x4E2A;&#x9690;&#x85CF;&#x5B57;&#x6BB5;&#xFF1A;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x8BE5;&#x884C;&#x7684;rowid&#x3001;&#x4E8B;&#x52A1;&#x53F7;db_trx_id&#x548C;&#x56DE;&#x6EDA;&#x6307;&#x9488;db_roll_ptr&#xFF0C;&#x5176;&#x4E2D;db_trx_id&#x8868;&#x793A;&#x6700;&#x8FD1;&#x4FEE;&#x6539;&#x7684;&#x4E8B;&#x52A1;&#x7684;id&#xFF0C;db_roll_ptr&#x6307;&#x5411;&#x56DE;&#x6EDA;&#x6BB5;&#x4E2D;&#x7684;undo log&#x3002;
&#x5F53;&#x4E8B;&#x52A1;2&#x4F7F;&#x7528;UPDATE&#x8BED;&#x53E5;&#x4FEE;&#x6539;&#x8BE5;&#x884C;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F1A;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x6392;&#x4ED6;&#x9501;&#x9501;&#x5B9A;&#x6539;&#x884C;&#xFF0C;&#x5C06;&#x8BE5;&#x884C;&#x5F53;&#x524D;&#x7684;&#x503C;&#x590D;&#x5236;&#x5230;undo log&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x771F;&#x6B63;&#x5730;&#x4FEE;&#x6539;&#x5F53;&#x524D;&#x884C;&#x7684;&#x503C;&#xFF0C;&#x6700;&#x540E;&#x586B;&#x5199;&#x4E8B;&#x52A1;ID&#xFF0C;&#x4F7F;&#x7528;&#x56DE;&#x6EDA;&#x6307;&#x9488;&#x6307;&#x5411;undo log&#x4E2D;&#x4FEE;&#x6539;&#x524D;&#x7684;&#x884C;&#x3002;</p>
<p>REPEATABLE READ&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x540E;&#x4F7F;&#x7528;MVVC&#x673A;&#x5236;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x5F53;&#x65F6;&#x6D3B;&#x52A8;&#x7684;&#x4E8B;&#x52A1;id&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8BB0;&#x5F55;&#x5230;Read View&#x4E2D;&#x3002;READ COMMITTED&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x5219;&#x662F;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x65F6;&#x90FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Read View&#x3002;
Read View&#x662F;InnoDB&#x4E2D;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x8BB0;&#x5F55;&#x53EF;&#x89C1;&#x6027;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8BB0;&#x5F55;&#x4E86;&#x4E00;&#x4E9B;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x53EF;&#x89C1;&#x6027;&#x7684;&#x5C5E;&#x6027;&#x3002;
creator_trx_id: &#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7684; id;</p>
<p>m_ids: &#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6D3B;&#x8DC3;&#x4E8B;&#x52A1;&#x7684; id&#xFF0C;&#x6D3B;&#x8DC3;&#x4E8B;&#x52A1;&#x6307;&#x7684;&#x662F;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F00;&#x542F;&#x4E86;&#x4E8B;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;;</p>
<p>min_trx_id: &#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x6D3B;&#x8DC3;&#x4E8B;&#x52A1;&#x4E2D;&#x4E8B;&#x52A1; id &#x6700;&#x5C0F;&#x7684;&#x90A3;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; m_id &#x6570;&#x7EC4;&#x4E2D;&#x6700;&#x5C0F;&#x7684;&#x4E8B;&#x52A1; id;</p>
<p>max_trx_id: &#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E8B;&#x52A1;&#x7684; id &#x503C;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#x4E8B;&#x52A1; id &#x503C;&#x518D;&#x52A0; 1&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x8981;&#x751F;&#x6210;&#x7684;&#x4E8B;&#x52A1; id&#x3002;</p>
<p>&#x5982;&#x679C;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684; row_trx_id &#x5C0F;&#x4E8E; min_trx_id&#xFF0C;&#x90A3;&#x4E48;&#x8868;&#x793A;&#x8FD9;&#x6761;&#x6570;&#x636E;&#x662F;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x4E4B;&#x524D;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x52A1;&#x5C31;&#x5DF2;&#x7ECF;&#x5C06;&#x8BE5;&#x6761;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x4E86;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x4E8B;&#x52A1;(&#x4E8B;&#x52A1;&#x7684; id &#x503C;&#x662F;&#x9012;&#x589E;&#x7684;)&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684; row_trx_id &#x5927;&#x4E8E;&#x7B49;&#x4E8E; max_trx_id&#xFF0C;&#x90A3;&#x4E48;&#x8868;&#x793A;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x4EE5;&#x540E;&#xFF0C;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x4E86;&#x8FD9;&#x884C;&#x6570;&#x636E;&#x7684;&#x503C;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x4E8B;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x662F;&#x540E;&#x9762;&#x7684;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;.</p>
<p>&#x5982;&#x679C;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684; row_trx_id &#x5904;&#x4E8E; min_trx_id &#x548C; max_trx_id &#x7684;&#x8303;&#x56F4;&#x4E4B;&#x95F4;&#xFF0C;&#x53C8;&#x9700;&#x8981;&#x5206;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;
row_trx_id &#x5728; m_ids &#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x3002;row_trx_id &#x5728; m_ids &#x6570;&#x7EC4;&#x4E2D;&#x8868;&#x793A;&#x7684;&#x662F;&#x548C;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x5F00;&#x542F;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x4FEE;&#x6539;&#x4E86;&#x6570;&#x636E;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x4E8B;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x8BA9;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x5230;;
row_trx_id &#x4E0D;&#x5728; m_ids &#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x3002;row_trx_id &#x4E0D;&#x5728; m_ids &#x6570;&#x7EC4;&#x4E2D;&#x8868;&#x793A;&#x7684;&#x662F;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x4E4B;&#x524D;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5C06;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x540E;&#x5C31;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x4E86;&#x4E8B;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x3002;</p>
<h4 id="27-rr&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;mysql&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x5E7B;&#x8BFB;">2.7 RR&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;Mysql&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x5E7B;&#x8BFB;</h4>
<p>&#x901A;&#x8FC7;MVCC&#x673A;&#x5236;&#xFF0C;&#x867D;&#x7136;&#x8BA9;&#x6570;&#x636E;&#x53D8;&#x5F97;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x4F46;&#x7528;&#x6237;&#x8BFB;&#x5230;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x662F;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5E93;&#x6700;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x8BFB;&#x53D6;&#x5386;&#x53F2;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EB;&#x5B83;&#x5FEB;&#x7167;&#x8BFB; (snapshot read)&#xFF0C;&#x800C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#x6700;&#x65B0;&#x7248;&#x672C;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EB;&#x5F53;&#x524D;&#x8BFB; (current read)&#x3002;</p>
<p>&#x5728;&#x5FEB;&#x7167;&#x8BFB;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Mysql&#x901A;&#x8FC7;MVCC&#x6765;&#x907F;&#x514D;&#x5E7B;&#x8BFB;, SELECT&#x4F7F;&#x7528;&#x5FEB;&#x7167;&#x8BFB;&#xFF0C;&#x800C;UPDATE,DELETE,INSERT&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x8BFB;&#x3002;</p>
<p>&#x5728;&#x5F53;&#x524D;&#x8BFB;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Mysql&#x901A;&#x8FC7;X&#x9501;&#x6216;Next-key&#x6765;&#x907F;&#x514D;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;:</p>
<p>1) &#x4F7F;&#x7528;&#x4E32;&#x884C;&#x5316;&#x8BFB;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;</p>
<p>2) (update&#x3001;delete)&#x5F53;where&#x6761;&#x4EF6;&#x4E3A;&#x4E3B;&#x952E;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x52A0;record locks(&#x7D22;&#x5F15;&#x52A0;&#x9501;/&#x884C;&#x9501;)&#x5904;&#x7406;&#x5E7B;&#x8BFB;&#x3002;</p>
<p>3) (update&#x3001;delete)&#x5F53;where&#x6761;&#x4EF6;&#x4E3A;&#x975E;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;next-key&#x9501;&#x5904;&#x7406;&#x3002;next-key&#x662F;record locks(&#x7D22;&#x5F15;&#x52A0;&#x9501;/&#x884C;&#x9501;) &#x548C; gap locks(&#x95F4;&#x9699;&#x9501;&#xFF0C;&#x6BCF;&#x6B21;&#x9501;&#x4F4F;&#x7684;&#x4E0D;&#x5149;&#x662F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x4F1A;&#x9501;&#x4F4F;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x9644;&#x8FD1;&#x7684;&#x6570;&#x636E;)&#x7684;&#x7ED3;&#x5408;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Mysql 锁与事务","level":"1.2","depth":1,"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Lock.md","mtime":"2021-09-17T07:58:47.179Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-09-17T08:06:50.196Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

